app/controllers/bears_controller.rb

  def index
    @bears = Bear.all
---
SELECT "bears".* FROM "bears"

  def create
    @bear = Bear.new(bear_params)

    if @bear.save
---
INSERT INTO "bears" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "koz"], ["description", "is cool\r\n"], ["created_at", "2016-02-01 16:47:35.770597"], ["updated_at", "2016-02-01 16:47:35.770597"]]

  def set_bear
    @bear = Bear.find(params[:id])
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 2]]